Repository: SantiagoKirylukMaclean/sport-tech-app
Catalog: lib/l10n/app_*.arb
Languages: ca, es

source: New Password
ca: Nova Contrasenya
es: Nueva Contraseña

# pleaseEnterNewPassword
source: Please enter a new password
ca: Si us plau, introdueix una nova contrasenya
es: Por favor ingrese una nueva contraseña

source: Confirm New Password
ca: Confirma Nova Contrasenya
es: Confirmar Nueva Contraseña

# pleaseConfirmNewPassword
source: Please confirm your new password
ca: Si us plau, confirma la teva nova contrasenya
es: Por favor confirme su nueva contraseña

source: Passwords do not match
ca: Les contrasenyes no coincideixen
es: Las contraseñas no coinciden

source: Update Password
ca: Actualitza Contrasenya
es: Actualizar Contraseña

# invitePlayerDialog
source: Invite Player
ca: Convida Jugador
es: Invitar Jugador

# chooseInvitationMethod
source: Choose how to send the invitation: via email or get a shareable link.
ca: Tria com enviar la invitació: via correu o obtenint un enllaç per compartir.
es: Elige cómo enviar la invitación: por correo electrónico u obtener un enlace compartible.

source: Send Email
ca: Envia Correu
es: Enviar Email

source: Get Link
ca: Obtén Enllaç
es: Obtener Enlace

# mustBeLoggedIn
source: You must be logged in to send invites
ca: Has d'iniciar sessió per enviar invitacions
es: Debes haber iniciado sesión para enviar invitaciones

# pleaseEnterClubName
source: Please enter a club name
ca: Si us plau, introdueix un nom de club
es: Por favor ingresa un nombre de club

# pleaseEnterSportName
source: Please enter a sport name
ca: Si us plau, introdueix un nom d'esport
es: Por favor ingresa un nombre de deporte

# pleaseEnterName
source: Please enter a name
ca: Si us plau, introdueix un nom
es: Por favor ingresa un nombre

# urlMustStartWithHttp
source: URL must start with http:// or https://
ca: L'URL ha de començar per http:// o https://
es: La URL debe comenzar con http:// o https://

# pleaseEnterEmail
source: Please enter an email
ca: Si us plau, introdueix un correu
es: Por favor ingresa un email

# invalidEmailFormat
source: Invalid email
ca: Format de correu no vàlid
es: Email inválido

source: Please enter player name
ca: Si us plau, introdueix el nom del jugador
es: Por favor ingresa el nombre del jugador

source: Invitation sent successfully
ca: Invitació enviada correctament
es: Invitación enviada exitosamente

source: Team Players
ca: Jugadors de l'Equip
es: Jugadores del Equipo

# newEvaluationBreadcrumb
source: New Evaluation
ca: Nova Avaluació
es: Nueva Evaluación

source: Detail
ca: Detall
es: Detalle

source: Lineup
ca: Alineació
es: Alineación

# playerRole
source: Player
ca: Jugador
es: Jugador

# coachRole
source: Coach
ca: Entrenador
es: Entrenador

# adminRole
source: Administrator
ca: Administrador
es: Administrador

source: Accepted
ca: Acceptada
es: Aceptada

source: Cancelled
ca: Cancel·lada
es: Cancelada

source: Pending
ca: Pendent
es: Pendiente

source: Player added successfully
ca: Jugador afegit correctament
es: Jugador agregado exitosamente

source: Player updated successfully
ca: Jugador actualitzat correctament
es: Jugador actualizado exitosamente

source: Standings
ca: Classificació

# standingsDescription
source: View championship standings table
ca: Veure la taula de classificació del campionat

source: Results
ca: Resultats

# resultsDescription
source: View match results
ca: Veure els resultats dels partits

source: Calendar
ca: Calendari

# calendarDescription
source: View match calendar
ca: Veure el calendari de partits

# noUrlAvailable
source: No {label} URL available
ca: No hi ha URL de {label} disponible
es: No hay URL de {label} disponible

# urlCopiedToClipboard
source: {label} URL copied to clipboard
ca: URL de {label} copiada al porta-retalls
es: URL de {label} copiada al portapapeles

# contactAdminForUrls
source: Please contact your administrator to configure the championship URLs
ca: Si us plau, contacta amb el teu administrador per configurar els URL del campionat

# webViewNotSupported
source: Web view is not available in browser version
ca: La vista web no està disponible en la versió del navegador

source: Copy URL
ca: Copia URL
es: Copiar URL

source: Open
ca: Obre
es: Abrir

source: Edit Training Session
ca: Edita Sessió d'Entrenament
es: Editar Sesión de Entrenamiento

source: New Training Session
ca: Nova Sessió d'Entrenament
es: Nueva Sesión de Entrenamiento

# addTrainingNotes
source: Add training notes (optional)
ca: Afegeix notes d'entrenament (opcional)
es: Agregar notas de entrenamiento (opcional)

source: Assign Credentials
ca: Assigna Credencials
es: Asignar Credenciales

# playerLabel
source: Player: {playerName}
ca: Jugador: {playerName}
es: Jugador: {playerName}

# createAccountForPlayer
source: Create an account so the player can access the app.
ca: Crea un compte perquè el jugador pugui accedir a l'app.
es: Crea una cuenta para que el jugador pueda acceder a la app.

source: Enter an email
ca: Introdueix un correu
es: Ingresa un email

source: Enter a password
ca: Introdueix una contrasenya
es: Ingresa una contraseña

# passwordMinLength
source: Password must be at least 6 characters
ca: La contrasenya ha de tenir almenys 6 caràcters
es: La contraseña debe tener al menos 6 caracteres

# playerCanUseCredentials
source: The player can use these credentials to log in to the app.
ca: El jugador pot utilitzar aquestes credencials per iniciar sessió.
es: El jugador podrá usar estas credenciales para iniciar sesión en la app.

source: Create Account
ca: Crea Compte
es: Crear Cuenta

source: Creating account...
ca: Creant compte...
es: Creando cuenta...

# accountCreatedFor
source: Account created for {playerName}
ca: Compte creat per a {playerName}
es: Cuenta creada para {playerName}

source: Set Password
ca: Estableix Contrasenya
es: Establecer Contraseña

source: Go to Login
ca: Ves al Login
es: Ir a Iniciar Sesión

# welcomeExclamation
source: Welcome!
ca: Benvingut!
es: ¡Bienvenido!

# invitedAsRole
source: You have been invited as a {role}
ca: Has estat convidat com a {role}
es: Has sido invitado como {role}

source: Processing authentication...
ca: Processant autenticació...

source: Redirecting to login...
ca: Redirigint al login...

source: Confirm Password
ca: Confirma Contrasenya
es: Confirmar Contraseña

# pleaseEnterPassword
source: Please enter a password
ca: Si us plau, introdueix una contrasenya
es: Por favor ingresa una contraseña

# passwordMinEightChars
source: Password must be at least 8 characters
ca: La contrasenya ha de tenir almenys 8 caràcters
es: La contraseña debe tener al menos 8 caracteres

# pleaseConfirmPassword
source: Please confirm your password
ca: Si us plau, confirma la teva contrasenya
es: Por favor confirma tu contraseña

# setPasswordAndJoin
source: Set Password & Join
ca: Desa Contrasenya i Uneix-te
es: Establecer Contraseña y Unirse

# accountCreatedSuccessfully
source: Account created successfully! Please log in.
ca: Compte creat correctament! Si us plau, inicia sessió.
es: ¡Cuenta creada exitosamente! Por favor inicia sesión.

# failedToCreateAccount
source: Failed to create account: {message}
ca: Error en crear compte: {message}
es: Error al crear cuenta: {message}

source: An error occurred
ca: Ha ocorregut un error
es: Ocurrió un error

# panelCoach
source: Coach Panel
ca: Panell d'Entrenador
es: Panel de Entrenador

# activeTeamLabel
source: Active Team
ca: Equip Actiu
es: Equipo Activo

# noTeamSelectedSelectFromDashboard
source: No team selected. Please select a team from the Dashboard.
ca: Cap equip seleccionat. Selecciona un equip des de l'Inici.
es: No hay equipo seleccionado. Por favor selecciona un equipo desde el Dashboard.

source: Manage team players
ca: Gestiona jugadors de l'equip
es: Gestionar jugadores del equipo

source: Manage trainings and attendance
ca: Gestiona entrenaments i assistència
es: Gestionar entrenamientos y asistencia

# manageMatchesLineupsResults
source: Manage matches, lineups and results
ca: Gestiona partits, alineacions i resultats
es: Gestionar partidos, alineaciones y resultados

source: Evaluate player performance
ca: Avalua el rendiment dels jugadors
es: Evaluar el rendimiento de los jugadores

source: Invite Staff Member
ca: Convida membre de l'Staff
es: Invitar Miembro del Staff

# invitationEmailWillBeSent
source: An invitation email will be sent with a link to set their password and join the team.
ca: S'enviarà un correu d'invitació amb un enllaç per establir la contrasenya i unir-se a l'equip.
es: Se enviará un email de invitación con un enlace para establecer su contraseña y unirse al equipo.

source: Send Invite
ca: Envia Invitació
es: Enviar Invitación

# failedToSendInvite
source: Failed to send invite: {error}
ca: Error en enviar invitació: {error}
es: Error al enviar invitación: {error}

source: Edit Match
ca: Edita Partit
es: Editar Partido

source: New Match
ca: Nou Partit
es: Nuevo Partido

source: Opponent
ca: Rival
es: Oponente

source: Enter opponent name
ca: Introdueix nom del rival
es: Ingresa el nombre del oponente

source: Match Date
ca: Data del Partit
es: Fecha del Partido

source: Location (Optional)
ca: Ubicació (Opcional)
es: Ubicación (Opcional)

source: Enter match location
ca: Introdueix ubicació del partit
es: Ingresa la ubicación del partido

source: Notes (Optional)
ca: Notes (Opcional)
es: Notas (Opcional)

source: Enter any notes
ca: Introdueix qualsevol nota
es: Ingresa cualquier nota

# teamPlayersTitle
source: Team Players
ca: Jugadors de l'Equip
es: Jugadores del Equipo

# noPlayersAddOne
source: No players found. Add one to get started!
ca: No s'han trobat jugadors. Afegeix-ne un per començar!
es: No se encontraron jugadores. ¡Agrega uno para comenzar!

source: Add Player
ca: Afegeix Jugador
es: Agregar Jugador

source: Delete Player
ca: Elimina Jugador
es: Eliminar Jugador

# confirmDeletePlayer
source: Are you sure you want to delete "{playerName}"?
ca: Estàs segur que vols eliminar "{playerName}"?
es: ¿Estás seguro de que quieres eliminar a "{playerName}"?

source: Player deleted successfully
ca: Jugador eliminat correctament
es: Jugador eliminado exitosamente

source: Match Detail
ca: Detall del Partit
es: Detalle del Partido

source: Match not found
ca: Partit no trobat
es: Partido no encontrado

# noQuarterResults
source: No quarter results recorded
ca: No hi ha resultats de parts registrats
es: No hay resultados por cuarto registrados

source: No goals recorded
ca: No hi ha gols registrats
es: No hay goles registrados

# assistanceLabel
source: Assistance: {playerName}
ca: Assistència: {playerName}
es: Asistencia: {playerName}

# noPlayerPeriodsInfo
source: No player periods information
ca: No hi ha informació de períodes del jugador
es: No hay información de jugadores por cuarto

# noPlayersInQuarter
source: No players in this quarter
ca: No hi ha jugadors en aquesta part
es: Sin jugadores en este cuarto

# zoneLabel
source: Zone: {zone}
ca: Zona: {zone}
es: Zona: {zone}

source: Users Management
ca: Gestió d'Usuaris
es: Gestión de Usuarios

source: All roles
ca: Tots els rols
es: Todos los roles

source: No users found
ca: No s'han trobat usuaris
es: No se encontraron usuarios

source: Registration Date
ca: Data de Registre
es: Fecha de Registro

# editUser
source: Edit User: {userName}
ca: Edita Usuari: {userName}
es: Editar Usuario: {userName}

source: Role updated successfully
ca: Rol actualitzat correctament
es: Rol actualizado exitosamente

source: Reset Password
ca: Restableix Contrasenya
es: Restablecer Contraseña

source: Password reset email sent
ca: Correu de restabliment de contrasenya enviat
es: Email de restablecimiento enviado

source: Failed to send reset
ca: Error en enviar restabliment
es: Error al enviar restablecimiento

source: Send Reset Email
ca: Envia Correu de Restabliment
es: Enviar Email de Restablecimiento

source: Invitations Management
ca: Gestió d'Invitacions
es: Gestión de Invitaciones

source: All statuses
ca: Tots els estats
es: Todos los estados

source: Expired
ca: Caducada
es: Expirada

source: No invitations found
ca: No s'han trobat invitacions
es: No se encontraron invitaciones

source: New Invitation
ca: Nova Invitació
es: Nueva Invitación

# roleLabel
source: Role: {role}
ca: Rol: {role}
es: Rol: {role}

# nameLabel
source: Name: {name}
ca: Nom: {name}
es: Nombre: {name}

# playerIdLabel
source: Player ID: {playerId}
ca: ID Jugador: {playerId}
es: ID Jugador: {playerId}

# invitationEmailSentTo
source: An invitation email has been sent to:
ca: S'ha enviat un correu d'invitació a:
es: Se ha enviado un email de invitación a:

# shareThisLink
source: Share this link with {email}:
ca: Comparteix aquest enllaç amb {email}:
es: Comparte este enlace con {email}:

# generalStats
source: General Statistics
ca: Estadístiques Generals

source: Performance by Quarter
ca: Rendiment per Part

# goalsAndAssists
source: Goals & Assists
ca: Gols i Assistències

source: Training Attendance Ranking
ca: Rànquing d'Assistència

# jerseyTitle
source: Jersey
ca: Dorsal

# trainingPercent
source: Training %
ca: % Entr.

# matchPercent
source: Match %
ca: % Part.

source: Avg Periods
ca: Períodes Mitj.

source: Goals For
ca: Gols Favor

source: Goals Against
ca: Gols Contra

source: Wins
ca: Victòries

source: Draws
ca: Empats

source: Losses
ca: Derrotes

source: Effectiveness
ca: Efectivitat

source: Effectiveness Calculation
ca: Càlcul d'Efectivitat

# effectivenessFormula
source: Effectiveness = (Wins × 3 + Draws × 1) / (Total Games × 3) × 100
ca: Efectivitat = (Victòries × 3 + Empats × 1) / (Total Partits × 3) × 100

source: Team Summary
ca: Resum d'Equip

source: Needs Work
ca: Millorable

# copyPendingImplementation
source: Copy functionality pending implementation
ca: Funcionalitat de copiar pendent d'implementació
es: Funcionalidad de copiar pendiente de implementar

source: Copy
ca: Copia
es: Copiar

source: Delete Invitation
ca: Elimina Invitació
es: Eliminar Invitación

# confirmDeleteInvitation
source: Are you sure you want to delete the invitation for "{email}"?
ca: Estàs segur que vols eliminar la invitació per a "{email}"?
es: ¿Estás seguro de que quieres eliminar la invitación para "{email}"?

source: Invitation deleted successfully
ca: Invitació eliminada correctament
es: Invitación eliminada exitosamente

# useAdminPanelForInvitations
source: Use the admin panel to create new invitations
ca: Utilitza el panell d'administració per crear noves invitacions
es: Usa el panel de administración para crear nuevas invitaciones

source: Filter by sport:
ca: Filtra per esport:
es: Filtrar por deporte:

# allSportsFilter
source: All sports
ca: Tots els esports
es: Todos los deportes

# selectSportToViewClubs
source: Select a sport to view clubs
ca: Selecciona un esport per veure els clubs
es: Selecciona un deporte para ver los clubes

source: New club
ca: Nou club
es: Nuevo club

source: Delete Club
ca: Elimina Club
es: Eliminar Club

# confirmDeleteClub
source: Are you sure you want to delete "{clubName}"?
ca: Estàs segur que vols eliminar "{clubName}"?
es: ¿Estás seguro de que quieres eliminar "{clubName}"?

source: Please rate all criteria
ca: Si us plau, puntua tots els criteris
es: Por favor califica todos los criterios

source: Evaluation saved successfully
ca: Avaluació desada correctament
es: Evaluación guardada exitosamente

# errorSaving
source: Error saving: {error}
ca: Error en desar: {error}
es: Error al guardar: {error}

# newEvaluationFor
source: New Evaluation - {playerName}
ca: Nova Avaluació - {playerName}
es: Nueva Evaluación - {playerName}

source: Evaluation Date
ca: Data d'Avaluació
es: Fecha de Evaluación

# noteFor
source: Note - {criterionName}
ca: Nota - {criterionName}
es: Nota - {criterionName}

# couldNotFindRoute
source: Could not find route: {route}
ca: No s'ha pogut trobar la ruta: {route}
es: No se encontró la ruta: {route}

source: Go to Home
ca: Ves a l'Inici
es: Ir al Inicio

source: No user authenticated
ca: Cap usuari autenticat
es: No hay usuario autenticado

source: Email copied
ca: Correu copiat
es: Email copiado

source: Open in new tab
ca: Obre en una nova pestanya
es: Abrir en nueva pestaña

source: Welcome, {email}!
ca: Benvingut, {email}!
es: ¡Bienvenido, {email}!

# authFailedDetail
source: Authentication failed. Please verify that: 1. The link has not expired 2. You have not used this link before
ca: Autenticació fallida. Si us plau, verifica que: 1. L'enllaç no hagi caducat 2. No hagis utilitzat aquest enllaç abans

source: Optional
ca: Opcional

source: Unknown Player
ca: Desconegut

# evaluationFor
source: Evaluation - {playerName}
ca: Avaluació - {playerName}
es: Evaluación - {playerName}

source: Select Color
ca: Selecciona Color
es: Seleccionar Color

source: Change Color
ca: Canvia Color
es: Cambiar Color

source: Clear color
ca: Neteja color
es: Limpiar color

source: Not selected
ca: No seleccionat
es: No seleccionado

source: Edit Sport
ca: Edita Esport
es: Editar Deporte

source: Create Sport
ca: Crea Esport
es: Crear Deporte

source: Sport Name
ca: Nom de l'Esport
es: Nombre del Deporte

source: My Matches
ca: Els meus partits
es: Mis Partidos

source: Did not play
ca: No ha jugat
es: No jugó

source: Error loading matches
ca: Error carregant partits
es: Error al cargar los partidos

source: No matches played
ca: No s'han jugat partits
es: No hay partidos jugados

source: Matches will appear here
ca: Els partits apareixeran aquí
es: Los partidos aparecerán aquí

source: Error loading match detail
ca: Error carregant detall del partit
es: Error al cargar el detalle del partido

source: My Performance
ca: El meu rendiment
es: Mi Desempeño

# hands
source: Assists
ca: Mans
es: Asistencias

source: Did not play in this match
ca: No ha jugat en aquest partit
es: No jugaste en este partido

source: Position
ca: Posició
es: Posición

source: Full quarter
ca: Part completa
es: Cuarto completo

source: Half quarter
ca: Mitja part
es: Medio cuarto

source: Match Results
ca: Resultats del Partit
es: Resultados del Partido

source: Final Result
ca: Resultat Final
es: Resultado Final

source: Victory
ca: Victòria
es: Victoria

source: Tie
ca: Empat
es: Empate

source: Defeat
ca: Derrota
es: Derrota

source: Coming Soon
ca: Properament
es: Próximamente

source: Match Rating
ca: Valoració del Partit
es: Puntaje del Partido

# matchRatingDescription
source: Your performance rating for this match
ca: La teva valoració de rendiment per a aquest partit
es: Tu calificación de desempeño para este partido

source: Match Notes
ca: Notes del Partit
es: Notas del Partido

# matchNotesDescription
source: Personal notes and observations about your performance
ca: Notes personals i observacions sobre el teu rendiment
es: Notas personales y observaciones sobre tu desempeño

source: Video Analysis
ca: Anàlisi de Vídeo
es: Análisis de Video

# videoAnalysisDescription
source: Link to video analysis of your performance
ca: Enllaç a l'anàlisi de vídeo del teu rendiment
es: Enlace al análisis de video de tu desempeño

source: Match Goals
ca: Gols del Partit
es: Goles del Partido

# ownGoalDescription
source: This goal will be recorded as an own goal by the opposing team in favor of our team.
ca: Aquest gol es registrarà com un autogol de l'equip contrari a favor del nostre equip.

source: Scorer
ca: Golejador
es: Goleador

source: Notes
es: Notas

source: Clubs
es: Clubes

source: Absent
es: Ausente

# minPlayersRequired
source: {count} / 7 min
es: {count} / 7 mín

source: No quarter results recorded
es: No hay resultados por cuarto registrados
