Repository: SantiagoKirylukMaclean/sport-tech-app
Catalog: lib/l10n/app_*.arb
Languages: ca, es

source: Team Sport Management
ca: Gestió d'Equips Esportius
es: Gestión de Deportes en Equipo

source: Login
ca: Inicia sessió
es: Iniciar sesión

source: Email
ca: Correu electrònic
es: Correo electrónico

source: Password
ca: Contrasenya
es: Contraseña

# enterEmail
source: Enter your email
ca: Introdueix el teu correu
es: Ingrese su correo electrónico

# enterPassword
source: Enter a password
ca: Introdueix una contrasenya
es: Ingresa una contraseña

source: Forgot password?
ca: Has oblidat la contrasenya?
es: ¿Olvidaste tu contraseña?

# forgotPasswordComingSoon
source: Forgot password feature coming soon
ca: Funció de recuperació de contrasenya properament
es: La función de recuperación de contraseña estará disponible pronto

# emailRequired
source: Email is required
ca: El correu és obligatori
es: El correo electrónico es obligatorio

# passwordRequired
source: Password is required
ca: La contrasenya és obligatòria
es: La contraseña es obligatoria

# invalidEmail
source: Please enter a valid email
ca: Si us plau, introdueix un correu vàlid
es: Por favor ingrese un correo electrónico válido

# passwordTooShort
source: Password must be at least 6 characters
ca: La contrasenya ha de tenir almenys 6 caràcters
es: La contraseña debe tener al menos 6 caracteres

source: Logout
ca: Tanca sessió
es: Cerrar sesión

# dashboard
source: Home
ca: Inici
es: Dashboard

source: Home
ca: Inici
es: Dashboard

source: Matches
ca: Partits
es: Partidos

source: Trainings
ca: Entrenaments
es: Entrenamiento

source: Championship
ca: Campionat
es: Campeonato

source: Evaluations
ca: Avaluacions
es: Evaluaciones

source: Profile
ca: Perfil
es: Perfil

source: Coach
ca: Entrenador
es: Entrenador

# mister
source: Coach
ca: Mister
es: Mister

source: Team *
ca: Equip *
es: Equipo *

# stats
source: Season Evaluations
ca: Avaluacions de temporada
es: Evaluaciones

source: More
ca: Més
es: Más

source: Settings
ca: Configuració
es: Configuración

source: Coach Panel
ca: Panell d'Entrenador
es: Panel de Entrenador

# superAdminPanel
source: Administration Panel
ca: Panell d'Administració
es: Panel de Administración

source: Teams Management
ca: Gestió d'Equips
es: Gestión de Equipos

source: Clubs Management
ca: Gestió de Clubs
es: Gestión de Clubes

source: Sports Management
ca: Gestió d'Esports
es: Gestión de Deportes

source: Players Management
ca: Gestió de Jugadors
es: Gestión de Jugadores

source: Welcome
ca: Benvingut
es: Bienvenido

source: Role
ca: Rol
es: Rol

source: Toggle theme
ca: Canvia el tema
es: Cambiar tema

source: Save
ca: Desa
es: Guardar

source: Cancel
ca: Cancel·la
es: Cancelar

source: Delete
ca: Elimina
es: Eliminar

source: Edit
ca: Edita
es: Editar

source: Add
ca: Afegeix
es: Agregar

source: Create
ca: Crea
es: Crear

source: Update
ca: Actualitza
es: Actualizar

source: Search
ca: Cerca
es: Buscar

source: Filter
ca: Filtra
es: Filtrar

source: Close
ca: Tanca
es: Cerrar

source: Confirm
ca: Confirma
es: Confirmar

source: Yes
ca: Sí
es: Sí

source: Loading...
ca: Carregant...
es: Cargando...

source: Success
ca: Èxit
es: Éxito

source: No data
ca: Sense dades
es: Sin datos

source: Name
ca: Nom
es: Nombre

source: Description
ca: Descripció
es: Descripción

source: Date
ca: Data
es: Fecha

source: Time
ca: Hora
es: Hora

source: Location
ca: Ubicació
es: Ubicación

source: Status
ca: Estat
es: Estado

source: Actions
ca: Accions
es: Acciones

# nameRequired
source: Name is required
ca: El nom és obligatori
es: El nombre es obligatorio

# descriptionRequired
source: Description is required
ca: La descripció és obligatòria
es: La descripción es obligatoria

# fieldRequired
source: This field is required
ca: Aquest camp és obligatori
es: Este campo es obligatorio

source: Invalid format
ca: Format no vàlid
es: Formato inválido

# saveSuccess
source: Saved successfully
ca: Desat correctament
es: Guardado exitosamente

# deleteSuccess
source: Deleted successfully
ca: Eliminat correctament
es: Eliminado exitosamente

# updateSuccess
source: Updated successfully
ca: Actualitzat correctament
es: Actualizado exitosamente

# createSuccess
source: Created successfully
ca: Creat correctament
es: Creado exitosamente

# saveError
source: Error saving
ca: Error en desar
es: Error al guardar

# deleteError
source: Error deleting
ca: Error en eliminar
es: Error al eliminar

# updateError
source: Error updating
ca: Error en actualitzar
es: Error al actualizar

# createError
source: Error creating
ca: Error en crear
es: Error al crear

# confirmDelete
source: Are you sure you want to delete this item?
ca: Estàs segur que vols eliminar aquest element?
es: ¿Está seguro de que desea eliminar este elemento?

source: Language
ca: Idioma
es: Idioma

source: English
ca: Anglès
es: Inglés

source: Spanish
ca: Castellà
es: Español

source: Catalan
ca: Català

source: App Settings
ca: Configuració de l'App
es: Configuración de la App

source: Appearance
ca: Aparença
es: Apariencia

source: Dark Mode
ca: Mode fosc
es: Modo Oscuro

source: Light Mode
ca: Mode clar
es: Modo Claro

# systemMode
source: System
ca: Sistema
es: Sistema

source: Preferences
ca: Preferències
es: Preferencias

source: Check for updates
ca: Cerca actualitzacions
es: Buscar actualizaciones

source: Checking for updates...
ca: Cercant actualitzacions...
es: Buscando actualizaciones...

source: No updates available
ca: No hi ha actualitzacions disponibles
es: No hay actualizaciones disponibles

# errorCheckingUpdates
source: Error checking for updates
ca: Error cercant actualitzacions
es: Error al buscar actualizaciones

source: More Options
ca: Més opcions
es: Más Opciones

source: Quick Access
ca: Accés ràpid
es: Acceso Rápido

source: My Notes
ca: Les meves notes
es: Mis Notas

source: Add Note
ca: Afegeix nota
es: Agregar Nota

source: Edit Note
ca: Edita nota
es: Editar Nota

source: Delete Note
ca: Elimina nota
es: Eliminar Nota

source: Note content
ca: Contingut de la nota
es: Contenido de la nota

# enterNoteContent
source: Enter your note...
ca: Escriu la teva nota...
es: Ingrese su nota...

# noteContentRequired
source: Note content is required
ca: El contingut de la nota és obligatori
es: El contenido de la nota es obligatorio

# noteCreated
source: Note created successfully
ca: Nota creada correctament
es: Nota creada exitosamente

# noteUpdated
source: Note updated successfully
ca: Nota actualitzada correctament
es: Nota actualizada exitosamente

# noteDeleted
source: Note deleted successfully
ca: Nota eliminada correctament
es: Nota eliminada exitosamente

# confirmDeleteNote
source: Are you sure you want to delete this note?
ca: Estàs segur que vols eliminar aquesta nota?
es: ¿Está seguro de que desea eliminar esta nota?

# noNotes
source: No notes yet. Create your first note!
ca: Encara no tens notes. Crea la primera!
es: Aún no hay notas. ¡Crea tu primera nota!

source: Error loading statistics
ca: Error carregant estadístiques
es: Error cargando estadísticas

source: Retry
ca: Reintenta
es: Reintentar

source: No player data
ca: Sense dades del jugador
es: Sin datos de jugador

# noPlayerRecordFound
source: No player record found for your account
ca: No s'ha trobat registre de jugador per al teu compte
es: No se encontró un registro de jugador para tu cuenta

source: Players
ca: Jugadors
es: Jugadores

source: Own Goals
ca: Gols en pròpia
es: Goles en Propia

source: Goals
ca: Gols
es: Goles

source: Quarters
ca: Parts
es: Cuartos

source: Quarter
ca: Part
es: Cuarto

source: Training
ca: Entrenament
es: Entrenamiento

# welcomeUser
source: Welcome, {userName}!
ca: Benvingut/da, {userName}!
es: ¡Bienvenido, {userName}!

# roleUser
source: Role: {role}
ca: Rol: {role}
es: Rol: {role}

# errorLoadingTeams
source: Error loading teams: {error}
ca: Error carregant equips: {error}
es: Error al cargar equipos: {error}

source: Select Team
ca: Selecciona equip
es: Seleccionar Equipo

# activeTeam
source: Active Team: {teamName}
ca: Equip actiu: {teamName}
es: Equipo Activo: {teamName}

source: No teams assigned.
ca: No hi ha equips assignats.
es: No hay equipos asignados.

source: No teams available
ca: No hi ha equips disponibles
es: No hay equipos disponibles

source: Administration Panel
ca: Panell d'Administració
es: Panel de administración

source: Sports
ca: Esports
es: Deportes

# manageSports
source: Manage sports in the system
ca: Gestiona els esports del sistema
es: Gestionar deportes del sistema

# manageClubs
source: Manage clubs and organizations
ca: Gestiona clubs i organitzacions
es: Gestionar clubes y organizaciones

source: Teams
ca: Equips
es: Equipos

# manageTeams
source: Manage teams in the system
ca: Gestiona equips del sistema
es: Gestionar equipos del sistema

source: Invite Coach/Admin
ca: Convida Entrenador/Admin
es: Invitar Entrenador/Admin

# sendInvitationsCoachAdmin
source: Send invitations to new coaches or administrators
ca: Envia invitacions a nous entrenadors o administradors
es: Enviar invitaciones a nuevos entrenadores o administradores

source: Invite Player
ca: Convida Jugador
es: Invitar Jugador

# sendInvitationsPlayers
source: Send invitations to new players
ca: Envia invitacions a nous jugadors
es: Enviar invitaciones a nuevos jugadores

source: Invitations
ca: Invitacions
es: Invitaciones

# viewManageInvitations
source: View and manage pending invitations
ca: Veure i gestionar invitacions pendents
es: Ver y gestionar invitaciones pendientes

source: Users
ca: Usuaris
es: Usuarios

# manageUsers
source: Manage system users
ca: Gestiona usuaris del sistema
es: Gestionar usuarios del sistema

source: Filters
ca: Filtres
es: Filtros

source: Refresh
ca: Actualitza
es: Refrescar

source: Sport
ca: Esport
es: Deporte

source: All sports
ca: Tots els esports
es: Todos los deportes

source: All clubs
ca: Tots els clubs
es: Todos los clubes

# selectSportAndClub
source: Select a sport and a club to view teams
ca: Selecciona un esport i un club per veure els equips
es: Selecciona un deporte y un club para ver los equipos

source: Teams ({count})
ca: Equips ({count})
es: Equipos ({count})

# noTeamsFound
source: No teams found. Create one to get started!
ca: No s'han trobat equips. Crea'n un per començar!
es: No se encontraron equipos. ¡Crea uno para comenzar!

source: New team
ca: Nou equip
es: Nuevo equipo

source: Team created successfully
ca: Equip creat correctament
es: Equipo creado exitosamente

source: Assign
ca: Assigna
es: Asignar

source: Delete Team
ca: Elimina Equip
es: Eliminar Equipo

# confirmDeleteTeam
source: Are you sure you want to delete "{teamName}"?
ca: Estàs segur que vols eliminar "{teamName}"?
es: ¿Estás seguro de que quieres eliminar "{teamName}"?

source: Team updated successfully
ca: Equip actualitzat correctament
es: Equipo actualizado exitosamente

source: Team deleted successfully
ca: Equip eliminat correctament
es: Equipo eliminado exitosamente

# createdOn
source: Created: {date}
ca: Creat: {date}
es: Creado: {date}

source: Create Player Invitation
ca: Crea invitació de jugador
es: Crear Invitación de Jugador

source: Email Address *
ca: Correu electrònic *
es: Correo Electrónico *

# emailAddressDescription
source: The email address of the player you want to invite
ca: El correu electrònic del jugador que vols convidar
es: El correo electrónico del jugador que deseas invitar

source: Email is required
ca: El correu és obligatori
es: El correo electrónico es obligatorio

# enterValidEmail
source: Please enter a valid email
ca: Si us plau, introdueix un correu vàlid
es: Por favor ingrese un correo electrónico válido

source: Player Name *
ca: Nom del jugador *
es: Nombre del Jugador *

# fullNamePlayer
source: Full name of the player
ca: Nom complet del jugador
es: Nombre completo del jugador

source: Player name is required
ca: El nom del jugador és obligatori
es: El nombre del jugador es obligatorio

# playerNameMinLength
source: Player name must be at least 2 characters
ca: El nom del jugador ha de tenir almenys 2 caràcters
es: El nombre del jugador debe tener al menos 2 caracteres

source: Jersey Number
ca: Dorsal
es: Número de Camiseta

# optionalJerseyNumber
source: Optional jersey/shirt number
ca: Número de samarreta opcional
es: Número de camiseta opcional

# jerseyNumberRange
source: Jersey number must be between 0 and 999
ca: El dorsal ha d'estar entre 0 i 999
es: El número de camiseta debe estar entre 0 y 999

# noTeamsAvailableCreateFirst
source: No teams available. Please create a team first.
ca: No hi ha equips disponibles. Si us plau, crea un equip primer.
es: No hay equipos disponibles. Por favor crea un equipo primero.

# selectTeamForPlayer
source: Select the team for this player
ca: Selecciona l'equip per a aquest jugador
es: Selecciona el equipo para este jugador

# pleaseSelectTeam
source: Please select a team
ca: Si us plau, selecciona un equip
es: Por favor selecciona un equipo

source: How it works:
ca: Com funciona:
es: Cómo funciona:

# invitationStep1
source: An invitation will be sent to the player's email
ca: S'enviarà una invitació al correu del jugador
es: Se enviará una invitación al correo del jugador

# invitationStep2
source: The player can accept and set up their account
ca: El jugador pot acceptar i configurar el seu compte
es: El jugador puede aceptar y configurar su cuenta

# invitationStep3
source: Once accepted, they'll have access to the app
ca: Un cop acceptada, tindrà accés a l'app
es: Una vez aceptada, tendrá acceso a la aplicación

source: Reset Form
ca: Reinicia formulari
es: Restablecer Formulario

source: Creating...
ca: Creant...
es: Creando...

source: Create Invitation
ca: Crea invitació
es: Crear Invitación

# failedToCreatePlayer
source: Failed to create player: {error}
ca: Error en crear jugador: {error}
es: Error al crear jugador: {error}

# playerCreatedAndInviteSent
source: Player {playerName} created and invitation sent successfully
ca: Jugador {playerName} creat i invitació enviada correctament
es: Jugador {playerName} creado e invitación enviada exitosamente

# playerCreatedButInviteFailed
source: Player created but failed to send invite: {error}
ca: Jugador creat però error en enviar invitació: {error}
es: Jugador creado pero error al enviar invitación: {error}

source: Sport created successfully
ca: Esport creat correctament
es: Deporte creado exitosamente

source: Sport updated successfully
ca: Esport actualitzat correctament
es: Deporte actualizado exitosamente

source: Sport deleted successfully
ca: Esport eliminat correctament
es: Deporte eliminado exitosamente

source: Club created successfully
ca: Club creat correctament
es: Club creado exitosamente

source: Club updated successfully
ca: Club actualitzat correctament
es: Club actualizado exitosamente

source: Club deleted successfully
ca: Club eliminat correctament
es: Club eliminado exitosamente

# noTeamSelectedSelectFirst
source: No team selected. Please select a team first.
ca: Cap equip seleccionat. Selecciona'n un primer.
es: No hay equipo seleccionado. Por favor selecciona un equipo primero.

source: Player Evaluations
ca: Avaluacions de Jugador
es: Evaluaciones de Jugadores

source: Select a Player
ca: Selecciona un Jugador
es: Selecciona un Jugador

# selectPlayer
source: Select a player
ca: Selecciona un jugador
es: Selecciona un jugador

# choosePlayerFromList
source: Choose a player from the list to view their evaluations
ca: Tria un jugador de la llista per veure les seves avaluacions
es: Elige un jugador de la lista para ver sus evaluaciones

source: New Evaluation
ca: Nova Avaluació
es: Nueva Evaluación

source: Create First Evaluation
ca: Crea la primera avaluació
es: Crear Primera Evaluación

source: Delete evaluation
ca: Elimina avaluació
es: Eliminar evaluación

# evaluationForPlayer
source: Evaluation - {playerName}
ca: Avaluació - {playerName}
es: Evaluación - {playerName}

source: Evaluation not found
ca: Avaluació no trobada
es: No se encontró la evaluación

source: Error: No authenticated user
ca: Error: Cap usuari autenticat
es: Error: No hay usuario autenticado

source: Loading data...
ca: Carregant dades...
es: Cargando datos...

source: No evaluations yet
ca: Encara no hi ha avaluacions
es: Aún no hay evaluaciones

source: Latest Evaluation
ca: Última Avaluació
es: Última Evaluación

source: Coach Notes
ca: Notes de l'entrenador
es: Notas del Entrenador

source: Evaluation History
ca: Historial d'avaluacions
es: Historial de Evaluaciones

# evaluationsCount
source: {count} evaluation(s)
ca: {count} avaluació(ns)
es: {count} evaluación(es)

source: No Team Selected
ca: Cap equip seleccionat
es: No hay Equipo Seleccionado

# selectTeamToViewMatches
source: Please select a team to view matches
ca: Si us plau, selecciona un equip per veure els partits
es: Por favor selecciona un equipo para ver los partidos

source: No matches yet
ca: Encara no hi ha partits
es: Aún no hay partidos

# createFirstMatch
source: Create your first match using the + button
ca: Crea el teu primer partit amb el botó +
es: Crea tu primer partido usando el botón +

source: Manage Call-Up
ca: Gestiona Convocatòria
es: Gestionar Convocatoria

# noPlayersFoundForTeam
source: No players found for this team
ca: No s'han trobat jugadors per a aquest equip
es: No se encontraron jugadores para este equipo

# jersey
source: Jersey: {number}
ca: Dorsal: {number}
es: Camiseta: {number}

source: Done
ca: Fet
es: Listo

source: Quarter result saved
ca: Resultat de la part desat
es: Resultado del cuarto guardado

source: Save Result
ca: Desa Resultat
es: Guardar Resultado

source: Add Goal
ca: Afegeix Gol
es: Agregar Gol

# assist
source: Assist: {assisterName}
ca: Assistència: {assisterName}
es: Asistencia: {assisterName}

source: None
ca: Cap
es: Ninguno

# opponentNameRequired
source: Opponent name is required
ca: El nom del rival és obligatori
es: El nombre del oponente es obligatorio

source: Training session created
ca: Sessió d'entrenament creada
es: Sesión de entrenamiento creada

source: Training session updated
ca: Sessió d'entrenament actualitzada
es: Sesión de entrenamiento actualizada

source: Delete Session
ca: Elimina Sessió
es: Eliminar Sesión

# confirmDeleteTrainingSession
source: Are you sure you want to delete this training session?
ca: Estàs segur que vols eliminar aquesta sessió d'entrenament?
es: ¿Estás seguro de que quieres eliminar esta sesión de entrenamiento?

source: Training session deleted
ca: Sessió d'entrenament eliminada
es: Sesión de entrenamiento eliminada

# pleaseSelectTeamFirst
source: Please select a team first
ca: Si us plau, selecciona un equip primer
es: Por favor selecciona un equipo primero

source: New Session
ca: Nova Sessió
es: Nueva Sesión

source: Manage Attendance
ca: Gestiona Assistència
es: Gestionar Asistencia

source: View Details
ca: Veure Detalls
es: Ver Detalles

source: Session not found
ca: Sessió no trobada
es: Sesión no encontrada

source: Training Sessions
ca: Sessions d'Entrenament
es: Entrenamientos

source: No training sessions
ca: No hi ha sessions d'entrenament
es: No hay entrenamientos

# noTrainingSessionsMessage
source: Training sessions will appear here
ca: Les sessions d'entrenament apareixeran aquí
es: Los entrenamientos aparecerán aquí

source: Session Information
ca: Informació de la Sessió
es: Información de la Sesión

source: Attendance List
ca: Llista d'Assistència
es: Lista de Asistencia

source: Attendance Statistics
ca: Estadístiques d'Assistència
es: Estadísticas de Asistencia

source: Total Players
ca: Total Jugadors
es: Total Jugadores

source: Attendance Rate
ca: Taxa d'Assistència
es: Tasa de Asistencia

source: Not Marked
ca: No Marcat
es: Sin Marcar

source: No players in team
ca: No hi ha jugadors a l'equip
es: No hay jugadores en el equipo

# errorLoadingPlayers
source: Error loading players: {message}
ca: Error carregant jugadors: {message}
es: Error al cargar jugadores: {message}

# errorUpdatingAttendance
source: Error updating attendance: {error}
ca: Error actualitzant assistència: {error}
es: Error al actualizar asistencia: {error}

source: Training Attendance
ca: Assistència a Entrenaments
es: Asistencia a Entrenamientos

source: On Time
ca: A temps
es: A Tiempo

source: Late
ca: Tard
es: Tarde

source: Attended
ca: Assistit
es: Asistieron

source: My Attendance
ca: La meva Assistència
es: Mi Asistencia

source: Team Attendance
ca: Assistència de l'Equip
es: Asistencia del Equipo

source: Training Session Details
ca: Detalls de la Sessió d'Entrenament
es: Detalles de la Sesión de Entrenamiento

source: Statistics
ca: Avaluacions
es: Evaluaciones

# noTrainingAttendanceData
source: No training attendance data available
ca: Sense dades d'assistència a entrenaments
es: No hay datos de asistencia de entrenamiento disponibles

# noGoalsOrAssistsData
source: No goals or assists data available
ca: Sense dades de gols o assistències
es: No hay datos de goles o asistencias disponibles

source: Player
ca: Jugador
es: Jugador

source: Assists
ca: Assistències
es: Asistencias

source: No matches played yet
ca: Encara no s'han jugat partits
es: Aún no se han jugado partidos

source: Matches Played
ca: Partits Jugats
es: Partidos Jugados

# winPercentage
source: Win %
ca: % Victòries
es: % Victorias

source: Goal Difference
ca: Diferència de Gols
es: Diferencia de Goles

source: Clean Sheets
ca: Porteries a Zero
es: Vallas Invictas

source: Average Goals
ca: Mitjana de Gols
es: Promedio de Goles

source: Match Attendance
ca: Assistència a Partits
es: Asistencia a Partidos

# winsDrawsLosses
source: {wins}W - {draws}D - {losses}L
ca: {wins}V - {draws}E - {losses}D
es: {wins}V - {draws}E - {losses}D

# goalsForAgainst
source: {goalsFor} for - {goalsAgainst} against
ca: {goalsFor} a favor - {goalsAgainst} en contra
es: {goalsFor} a favor - {goalsAgainst} en contra

source: {percentage}% of matches
ca: {percentage}% dels partits
es: {percentage}% de los partidos

# forAgainstAverage
source: For: {forAvg} | Against: {againstAvg}
ca: Fav: {forAvg} | Con: {againstAvg}
es: A favor: {forAvg} | En contra: {againstAvg}

source: See details
ca: Veure detalls
es: Ver detalles

# myStatistics
source: {playerName} Statistics
ca: Estadístiques de {playerName}
es: Mis Estadísticas

# teamStatistics
source: {teamName} Statistics
ca: Estadístiques de {teamName}
es: Estadísticas del Equipo

source: Quarters Played
ca: Parts Jugades
es: Cuartos Jugados

source: Interventions
ca: Intervencions
es: Intervenciones

source: Attendance
ca: Assistència
es: Asistencia

source: Average
ca: Mitjana

source: Maximum
ca: Màxim

source: Minimum
ca: Mínim

source: Summary
ca: Resum

source: Average of
ca: Mitjana de
es: Promedio de

source: trainings done
ca: entrenaments fets

# percentageTotalMatches
source: of total matches played
ca: del total de partits

# teamAttendanceMatches
source: team training attendance
ca: assistència equip entrenaments

source: goals average
ca: mitjana de gols

# pointsWin
source: points won
ca: punts guanyats

# matchesPlayedSubtitle
source: {percentage}% of {total}
ca: {percentage}% de {total}

# trainingsDoneSubtitle
source: {percentage}% of {total}
ca: {percentage}% de {total}

# quartersPlayedSubtitle
source: {percentage}% attendance of full match
ca: {percentage}% assistència de partit complet

# pointsWonPercentage
source: {percentage}% of possible points
ca: {percentage}% dels punts possibles

source: Account Information
ca: Informació del Compte
es: Información de la Cuenta

source: Change Password
ca: Canvia Contrasenya
es: Cambiar Contraseña

source: Password updated successfully
ca: Contrasenya actualitzada correctament
es: Contraseña actualizada exitosamente

source: Current Password
ca: Contrasenya actual
es: Contraseña Actual

# pleaseEnterCurrentPassword
source: Please enter your current password
ca: Si us plau, introdueix la teva contrasenya actual
es: Por favor ingrese su contraseña actual
